bkari02/sensebox-s2-bsp/esp32-sensebox/hardware/esp32/2.0.0/boards.txt
sensebox_mcu_s2.menu.DebugLevel.none=None
sensebox_mcu_s2.menu.DebugLevel.none.build.code_debug=0
sensebox_mcu_s2.menu.DebugLevel.error=Error
sensebox_mcu_s2.menu.DebugLevel.error.build.code_debug=1
sensebox_mcu_s2.menu.DebugLevel.warn=Warn
sensebox_mcu_s2.menu.DebugLevel.warn.build.code_debug=2
sensebox_mcu_s2.menu.DebugLevel.info=Info
sensebox_mcu_s2.menu.DebugLevel.info.build.code_debug=3
sensebox_mcu_s2.menu.DebugLevel.debug=Debug
sensebox_mcu_s2.menu.DebugLevel.debug.build.code_debug=4
sensebox_mcu_s2.menu.DebugLevel.verbose=Verbose
sensebox_mcu_s2.menu.DebugLevel.verbose.build.code_debug=5

sensebox_mcu_s2.menu.EraseFlash.none=Disabled
sensebox_mcu_s2.menu.EraseFlash.none.upload.erase_cmd=
sensebox_mcu_s2.menu.EraseFlash.all=Enabled
sensebox_mcu_s2.menu.EraseFlash.all.upload.erase_cmd=-e


##############################################################

feathers2.name=UM FeatherS2
feathers2.vid.0=0x239A
feathers2.pid.0=0x80AB

feathers2.bootloader.tool=esptool_py
feathers2.bootloader.tool.default=esptool_py

feathers2.upload.tool=esptool_py
feathers2.upload.tool.default=esptool_py
feathers2.upload.tool.network=esp_ota

feathers2.upload.maximum_size=1310720
feathers2.upload.maximum_data_size=327680
feathers2.upload.flags=
feathers2.upload.extra_flags=
feathers2.upload.use_1200bps_touch=true
feathers2.upload.wait_for_upload_port=true

feathers2.serial.disableDTR=false
feathers2.serial.disableRTS=false

feathers2.build.tarch=xtensa
feathers2.build.bootloader_addr=0x1000
feathers2.build.target=esp32s2
feathers2.build.mcu=esp32s2
feathers2.build.core=esp32
feathers2.build.variant=um_feathers2
feathers2.build.board=FEATHERS2

feathers2.build.cdc_on_boot=1
feathers2.build.msc_on_boot=0
feathers2.build.dfu_on_boot=0
feathers2.build.f_cpu=240000000L
feathers2.build.flash_size=16MB
feathers2.build.flash_freq=80m
feathers2.build.flash_mode=dio
feathers2.build.boot=qio
feathers2.build.partitions=fatflash
feathers2.build.defines=

feathers2.menu.CDCOnBoot.cdc=Enabled
feathers2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
feathers2.menu.CDCOnBoot.default=Disabled
feathers2.menu.CDCOnBoot.default.build.cdc_on_boot=0

feathers2.menu.MSCOnBoot.default=Disabled
feathers2.menu.MSCOnBoot.default.build.msc_on_boot=0
feathers2.menu.MSCOnBoot.msc=Enabled
feathers2.menu.MSCOnBoot.msc.build.msc_on_boot=1

feathers2.menu.DFUOnBoot.default=Disabled
feathers2.menu.DFUOnBoot.default.build.dfu_on_boot=0
feathers2.menu.DFUOnBoot.dfu=Enabled
feathers2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

feathers2.menu.PSRAM.enabled=Enabled
feathers2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
feathers2.menu.PSRAM.disabled=Disabled
feathers2.menu.PSRAM.disabled.build.defines=

feathers2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
feathers2.menu.PartitionScheme.fatflash.build.partitions=ffat
feathers2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
feathers2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
feathers2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
feathers2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
feathers2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
feathers2.menu.PartitionScheme.default.build.partitions=default
feathers2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
feathers2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
feathers2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
feathers2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
feathers2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
feathers2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
feathers2.menu.PartitionScheme.minimal.build.partitions=minimal
feathers2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
feathers2.menu.PartitionScheme.no_ota.build.partitions=no_ota
feathers2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
feathers2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
feathers2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
feathers2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
feathers2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
feathers2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
feathers2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
feathers2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
feathers2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
feathers2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
feathers2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
feathers2.menu.PartitionScheme.huge_app.build.partitions=huge_app
feathers2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
feathers2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
feathers2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
feathers2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

feathers2.menu.CPUFreq.240=240MHz (WiFi)
feathers2.menu.CPUFreq.240.build.f_cpu=240000000L
feathers2.menu.CPUFreq.160=160MHz (WiFi)
feathers2.menu.CPUFreq.160.build.f_cpu=160000000L
feathers2.menu.CPUFreq.80=80MHz (WiFi)
feathers2.menu.CPUFreq.80.build.f_cpu=80000000L
feathers2.menu.CPUFreq.40=40MHz
feathers2.menu.CPUFreq.40.build.f_cpu=40000000L
feathers2.menu.CPUFreq.20=20MHz
feathers2.menu.CPUFreq.20.build.f_cpu=20000000L
feathers2.menu.CPUFreq.10=10MHz
feathers2.menu.CPUFreq.10.build.f_cpu=10000000L

feathers2.menu.FlashSize.16M=16MB (128Mb)
feathers2.menu.FlashSize.16M.build.flash_size=16MB
feathers2.menu.FlashSize.4M=4MB (32Mb)
feathers2.menu.FlashSize.4M.build.flash_size=4MB
feathers2.menu.FlashSize.8M=8MB (64Mb)
feathers2.menu.FlashSize.8M.build.flash_size=8MB
feathers2.menu.FlashSize.8M.build.partitions=default_8MB
feathers2.menu.FlashSize.2M=2MB (16Mb)
feathers2.menu.FlashSize.2M.build.flash_size=2MB
feathers2.menu.FlashSize.2M.build.partitions=minimal

feathers2.menu.UploadSpeed.921600=921600
feathers2.menu.UploadSpeed.921600.upload.speed=921600
feathers2.menu.UploadSpeed.115200=115200
feathers2.menu.UploadSpeed.115200.upload.speed=115200
feathers2.menu.UploadSpeed.256000.windows=256000
feathers2.menu.UploadSpeed.256000.upload.speed=256000
feathers2.menu.UploadSpeed.230400.windows.upload.speed=256000
feathers2.menu.UploadSpeed.230400=230400
feathers2.menu.UploadSpeed.230400.upload.speed=230400
feathers2.menu.UploadSpeed.460800.linux=460800
feathers2.menu.UploadSpeed.460800.macosx=460800
feathers2.menu.UploadSpeed.460800.upload.speed=460800

feathers2.menu.DebugLevel.none=None
feathers2.menu.DebugLevel.none.build.code_debug=0
feathers2.menu.DebugLevel.error=Error
feathers2.menu.DebugLevel.error.build.code_debug=1
feathers2.menu.DebugLevel.warn=Warn
feathers2.menu.DebugLevel.warn.build.code_debug=2
feathers2.menu.DebugLevel.info=Info
feathers2.menu.DebugLevel.info.build.code_debug=3
feathers2.menu.DebugLevel.debug=Debug
feathers2.menu.DebugLevel.debug.build.code_debug=4
feathers2.menu.DebugLevel.verbose=Verbose
feathers2.menu.DebugLevel.verbose.build.code_debug=5

feathers2.menu.EraseFlash.none=Disabled
feathers2.menu.EraseFlash.none.upload.erase_cmd=
feathers2.menu.EraseFlash.all=Enabled
feathers2.menu.EraseFlash.all.upload.erase_cmd=-e


##############################################################
